[{"model": "portifolio.tarefa", "pk": 2, "fields": {"titulo": "qweqwaS", "prioridade": 1, "concluida": false, "criado": "2023-06-18T01:32:21.042Z"}}, {"model": "portifolio.tarefa", "pk": 3, "fields": {"titulo": "felipeas", "prioridade": 1, "concluida": false, "criado": "2023-06-19T02:13:05.773Z"}}, {"model": "portifolio.tarefa", "pk": 5, "fields": {"titulo": "fdvfb", "prioridade": 1, "concluida": false, "criado": "2023-06-19T12:50:13.506Z"}}, {"model": "portifolio.tarefa", "pk": 6, "fields": {"titulo": "fddf", "prioridade": 1, "concluida": false, "criado": "2023-06-19T13:53:24.904Z"}}, {"model": "portifolio.tarefa", "pk": 7, "fields": {"titulo": "dfhfh", "prioridade": 1, "concluida": false, "criado": "2023-06-19T13:53:27.504Z"}}, {"model": "portifolio.tarefa", "pk": 8, "fields": {"titulo": "12324", "prioridade": 2, "concluida": false, "criado": "2023-06-19T14:00:04.384Z"}}, {"model": "portifolio.tarefa", "pk": 9, "fields": {"titulo": "teste", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:24:31.033Z"}}, {"model": "portifolio.tarefa", "pk": 10, "fields": {"titulo": "123", "prioridade": 2, "concluida": false, "criado": "2023-06-20T01:24:48.944Z"}}, {"model": "portifolio.tarefa", "pk": 11, "fields": {"titulo": "789789", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:28:02.488Z"}}, {"model": "portifolio.tarefa", "pk": 12, "fields": {"titulo": "23423", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:29:55.255Z"}}, {"model": "portifolio.tarefa", "pk": 13, "fields": {"titulo": "gfdgdf", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:31:28.666Z"}}, {"model": "portifolio.tarefa", "pk": 14, "fields": {"titulo": "kyukyu", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:31:31.737Z"}}, {"model": "portifolio.tarefa", "pk": 15, "fields": {"titulo": "popop", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:31:33.931Z"}}, {"model": "portifolio.tarefa", "pk": 16, "fields": {"titulo": "56uyty5677i", "prioridade": 1, "concluida": false, "criado": "2023-06-20T01:31:40.975Z"}}, {"model": "portifolio.tarefa", "pk": 17, "fields": {"titulo": "asda", "prioridade": 1, "concluida": false, "criado": "2023-06-20T09:24:58.944Z"}}, {"model": "portifolio.tarefa", "pk": 18, "fields": {"titulo": "asdas12313", "prioridade": 1, "concluida": false, "criado": "2023-06-20T09:25:18.760Z"}}, {"model": "portifolio.airport", "pk": 1, "fields": {"code": "LIS", "city": "Lisboa"}}, {"model": "portifolio.airport", "pk": 2, "fields": {"code": "SP", "city": "SÒo Paulo"}}, {"model": "portifolio.airport", "pk": 3, "fields": {"code": "MC", "city": "Macau"}}, {"model": "portifolio.flight", "pk": 1, "fields": {"origin": 1, "destination": 2, "duration": 20}}, {"model": "portifolio.flight", "pk": 2, "fields": {"origin": 2, "destination": 3, "duration": 3}}, {"model": "portifolio.flight", "pk": 3, "fields": {"origin": 3, "destination": 1, "duration": 6}}, {"model": "portifolio.flight", "pk": 4, "fields": {"origin": 2, "destination": 2, "duration": 22}}, {"model": "portifolio.passenger", "pk": 1, "fields": {"name": "Felipe Silva", "flights": []}}, {"model": "portifolio.passenger", "pk": 2, "fields": {"name": "Elainw", "flights": []}}, {"model": "portifolio.passenger", "pk": 3, "fields": {"name": "fdfsdf", "flights": [3]}}, {"model": "portifolio.passenger", "pk": 4, "fields": {"name": "123", "flights": [4]}}, {"model": "portifolio.passenger", "pk": 5, "fields": {"name": "uiou", "flights": [2]}}, {"model": "portifolio.passenger", "pk": 6, "fields": {"name": "fdvf", "flights": []}}, {"model": "portifolio.sobremim", "pk": 5, "fields": {"titulo": "comp", "prioridade": 1, "concluida": false, "criado": "2023-06-29T01:24:14.307Z"}}, {"model": "portifolio.sobremim", "pk": 6, "fields": {"titulo": "fwisle", "prioridade": 1, "concluida": false, "criado": "2023-06-30T20:13:13.979Z"}}, {"model": "portifolio.sobremim", "pk": 7, "fields": {"titulo": "sgsgsv", "prioridade": 2, "concluida": false, "criado": "2023-07-01T17:13:29.554Z"}}, {"model": "portifolio.pessoa", "pk": 1, "fields": {"nome": "Lucio Studer", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 8, "fields": {"nome": "Pedro Alves", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 9, "fields": {"nome": "Pedro Arroz", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 10, "fields": {"nome": "Sergio Nunes", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 11, "fields": {"nome": "Joao Carvalho", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 12, "fields": {"nome": "Rui Ribeiro", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 13, "fields": {"nome": "Joao Canto", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 14, "fields": {"nome": "Cristina Guerra", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 15, "fields": {"nome": "Diogo Morais", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.pessoa", "pk": 16, "fields": {"nome": "Slavisa Tomic", "descricao": "...", "link_linkedin": "https://moodle.ensinolusofona.pt/"}}, {"model": "portifolio.projeto", "pk": 12, "fields": {"nome": "Arduino Car-AMG", "dificuldade": "dificil", "data_inicio": "2023-03-04", "data_conclusao": "2023-07-08", "descricao": "During the development of the Arduino 4WD Car project, I primarily used the Arduino programming language to write the necessary code for controlling the motors, ultrasonic sensor, and other functionalities of the car. Through the use of the Arduino language, I learned how to efficiently program the Arduino UNO board, making it possible to create an autonomous vehicle.\r\n\r\nFurthermore, I gained knowledge in electronics, as I had to assemble and connect the car's components, such as the motors, motor driver, ultrasonic sensor, and Bluetooth module. I learned about the importance of following wiring diagrams and using proper cables and connectors to ensure the safe and reliable operation of the project.\r\n\r\nThroughout the process, I also developed analytical skills when analyzing sensor data and identifying operational issues. For example, during motor testing, I noticed incorrect rotation and had to reverse the wire connections to correct the motor direction. This ability to analyze data and make quick decisions was crucial for the project's success.\r\n\r\nAn important skill that I was able to highlight was creativity and innovation in implementing extra features. In addition to infrared control, I added the option of Bluetooth control, which expanded the possibilities for interacting with the car. The ability to think beyond the obvious and propose innovative solutions can be a differentiator in future projects.\r\n\r\nDuring the car assembly process, I also developed organizational and time management skills. The project involved various stages, from preparing the components to programming the code, and I had to plan each step to meet the established deadlines.\r\n\r\nIt is also important to emphasize the importance of clear and effective communication. In the project documentation, I sought to detail each assembly step and explain the concepts in an understandable way so that other people could easily replicate the project.\r\n\r\nFinally, adaptability was a skill that proved relevant during the process. I faced some unexpected challenges, such as adjusting the assembly of the ultrasonic sensor to the servo bracket, but I managed to find creative solutions to overcome them.\r\n\r\nOverall, the Arduino 4WD Car project provided me with an enriching experience, combining programming knowledge, electronics, and practical assembly skills. Furthermore, I highlight the importance of teamwork and the continuous pursuit of learning and enhancing my technical and analytical skills for future challenging projects.\r\n\r\nGitHub: https://github.com/felipegsi/CarArduinoACC", "ranking": 5, "imagem": "projetos/car_arduino.png"}}, {"model": "portifolio.projeto", "pk": 13, "fields": {"nome": "DeisiFlix", "dificuldade": "dificil", "data_inicio": "2023-06-04", "data_conclusao": "2023-06-04", "descricao": "Durante o projeto, foram utilizadas as linguagens de programaþÒo Java para desenvolver a aplicaþÒo e CSV para a leitura dos dados da base de dados de filmes. Aprendi a trabalhar com estruturas de dados eficientes e algoritmos otimizados para melhorar o desempenho da aplicaþÒo.\r\n\r\nHabilidades importantes que podem ser realþadas incluem:\r\n\r\nHabilidades AnalÝticas: A capacidade de analisar os requisitos do projeto e identificar as melhores estruturas de dados e algoritmos para garantir a eficiÛncia do programa.\r\n\r\nConhecimento de Estruturas de Dados e Algoritmos: UtilizaþÒo de estruturas de dados, como listas, ßrvores, tabelas hash, para armazenar e manipular os dados da base de dados de filmes de forma eficiente.\r\n\r\nOtimizaþÒo de C¾digo: Realizar mediþ§es dos tempos de execuþÒo de diferentes partes do programa para identificar e resolver possÝveis gargalos e melhorar os tempos de execuþÒo.\r\n\r\nImplementaþÒo de Perguntas PadrÒo: Desenvolvimento das funcionalidades para responder Ós perguntas padrÒo, como contar filmes por ator, listar filmes em que um ator participou num certo ano, entre outras.\r\n\r\nTrabalho com Dados: ManipulaþÒo de dados em formato CSV, leitura dos dados da base de dados de filmes e cßlculos estatÝsticos necessßrios para responder Ós perguntas do projeto.\r\n\r\nOrganizaþÒo e DocumentaþÒo: OrganizaþÒo do c¾digo-fonte de forma clara e bem documentada para facilitar a leitura e manutenþÒo do programa.\r\n\r\nResoluþÒo de Problemas: Lidar com desafios e problemas que surgem durante o desenvolvimento da aplicaþÒo, buscando soluþ§es eficazes e eficientes.\r\n\r\nCapacidade de Aprendizado: Aproveitar o conhecimento adquirido em AED (Algoritmia e Estruturas de Dados) para enfrentar novos desafios e aprender continuamente durante o desenvolvimento do projeto.\r\n\r\nNo geral, o projeto \"DeisiFlix\" proporcionou-me a oportunidade de aplicar conhecimentos te¾ricos de estruturas de dados e algoritmos em um projeto prßtico, desenvolvendo uma aplicaþÒo funcional e eficiente para responder a perguntas sobre uma base de dados de filmes. Essa experiÛncia enriquecedora me permitiu aprimorar minhas habilidades analÝticas, de programaþÒo e resoluþÒo de problemas, bem como fortalecer minha capacidade de trabalhar em projetos desafiadores.", "ranking": 5, "imagem": "projetos/DeisiFlix.png"}}, {"model": "portifolio.projeto", "pk": 14, "fields": {"nome": "DeisiJungle", "dificuldade": "dificil", "data_inicio": "2023-06-04", "data_conclusao": "2023-06-04", "descricao": "...", "ranking": 5, "imagem": "projetos/DeisiJungle.png"}}, {"model": "portifolio.projeto", "pk": 15, "fields": {"nome": "Maquina de Lavar (Funcional)", "dificuldade": "dificil", "data_inicio": "2023-06-04", "data_conclusao": "2023-06-04", "descricao": "...", "ranking": 5, "imagem": "projetos/MaquinaLavar.png"}}, {"model": "portifolio.projeto", "pk": 16, "fields": {"nome": "Minesweeper", "dificuldade": "medio", "data_inicio": "2023-06-04", "data_conclusao": "2023-06-04", "descricao": "...", "ranking": 4, "imagem": "projetos/MineProj.png"}}, {"model": "portifolio.projeto", "pk": 17, "fields": {"nome": "Data Base Project", "dificuldade": "medio", "data_inicio": "2023-06-04", "data_conclusao": "2023-06-04", "descricao": "...", "ranking": 3, "imagem": "projetos/ProjBaseDeDados.png"}}, {"model": "portifolio.projeto", "pk": 18, "fields": {"nome": "Ludo Play", "dificuldade": "medio", "data_inicio": "2023-06-04", "data_conclusao": "2023-06-04", "descricao": "...", "ranking": 4, "imagem": "projetos/NaoTeConstipes.png"}}, {"model": "portifolio.projeto", "pk": 19, "fields": {"nome": "Astronaut Project", "dificuldade": "medio", "data_inicio": "2021-05-01", "data_conclusao": "2021-06-01", "descricao": "The project's goal is to determine the optimal conditions for an astronaut to achieve a maximum horizontal distance of 100 meters in a jump that occurs within a 2-second time interval. To achieve this objective, we will need to calculate three essential variables:\r\n\r\nJump Angle: We will determine the angle at which the astronaut should jump to optimize the distance covered.\r\n\r\nInitial Velocity: We will find the initial velocity required for the astronaut to reach the desired distance.\r\n\r\nJump Height: We will calculate the maximum height that the astronaut will reach during the jump.\r\n\r\nThis scenario challenges our knowledge of mechanics and physics, requiring the application of motion equations in an environment with different gravity conditions compared to Earth. This project represents an exciting opportunity to apply physics concepts in a space-related context.", "ranking": 3, "imagem": "projetos/Astronaut_Fisica.jpg"}}, {"model": "portifolio.projeto", "pk": 20, "fields": {"nome": "Portfolio (WIX)", "dificuldade": "medio", "data_inicio": "2022-05-01", "data_conclusao": "2022-06-01", "descricao": "I made a portfolio with the help of WIX\r\n \r\nhttps://felipeguimaraes978.wixsite.com/my-site", "ranking": 4, "imagem": "projetos/PortWIX__CC.jpeg"}}, {"model": "portifolio.projeto", "pk": 21, "fields": {"nome": "FoodMart (Data WareHouse)", "dificuldade": "medio", "data_inicio": "2022-11-16", "data_conclusao": "2023-01-16", "descricao": "Neste projeto, fui incumbido de aplicar processos de relat¾rios, ETL (ExtraþÒo, TransformaþÒo e Carga) e modelagem dimensional, com o suporte do Power BI para apresentaþÒo visual.", "ranking": 4, "imagem": "projetos/FoodMart_SSD.jpg"}}, {"model": "portifolio.projeto", "pk": 22, "fields": {"nome": "Computer graphics", "dificuldade": "dificil", "data_inicio": "2023-04-26", "data_conclusao": "2023-06-01", "descricao": "This Computer Graphics project, dated April 26, 2023, aims to develop a program capable of solving puzzles through digital image processing. The puzzle is represented by an image in which the pieces are randomly distributed with the face facing upwards on a uniform and contrasting background. The program should locate the pieces and identify the edges of the pieces that have the highest similarity (pixel by pixel) to each other so they can be joined, resulting in the puzzle's solution.\r\n\r\nFor the user, the procedure involves opening an image containing the puzzle within the application and processing it, resulting in the solution to the puzzle. Students are encouraged to test their work with additional examples, beyond those provided by the instructor, to ensure the robustness of the developed application.\r\n\r\nThe project offers three levels of difficulty:\r\n\r\nLevel 1: Puzzle with 2 pieces (square or rectangular) correctly aligned.\r\nLevel 2: Puzzle with 2 square or rectangular pieces rotated up to 45 degrees.\r\nLevel 3: Puzzle with more than 2 square/rectangular pieces rotated up to 45 degrees.\r\nApplication requirements include:\r\n\r\nProviding the user with an interface that allows the application of all functions developed in practical classes.\r\nProviding a suitable interface for puzzle analysis.\r\nIdentifying puzzle pieces using an object detection technique, preferably the connected components algorithm.\r\nCalculating pixel-by-pixel similarity between any two edges to verify the order of piece placement.\r\nFor levels 2 and above, determining the rotation of the pieces and reorienting them.", "ranking": 2, "imagem": "projetos/CG.jpg"}}, {"model": "portifolio.projeto", "pk": 23, "fields": {"nome": "Tobacco store", "dificuldade": "medio", "data_inicio": "2023-10-14", "data_conclusao": "2023-10-14", "descricao": "Prop¾sito do Projeto:\r\nO prop¾sito deste projeto Ú desenvolver um sistema de informaþÒo com base em um caso de estudo fornecido pelo professor na disciplina de Engenharia de Requisitos e Testes (ERT). O projeto visa aprimorar as habilidades dos estudantes em anßlise de requisitos, planeamento de projetos, desenho de testes e anßlise de falhas. O foco principal nesta fase Ú realizar o desenho de testes para garantir a qualidade do sistema e prevenir falhas. AlÚm disso, os estudantes devem identificar as possÝveis falhas na soluþÒo proposta pelos requisitos e determinar suas causas.\r\n\r\nMÚtodo de ResoluþÒo:\r\nO projeto Ú dividido em vßrias entregas, comeþando pela anßlise do caso de estudo, identificaþÒo de requisitos, planeamento do projeto, e, finalmente, o desenho de testes e anßlise de falhas. Os estudantes devem criar testes detalhados (Test Cases) para todos os requisitos do projeto, incluindo testes de aceitaþÒo e, quando relevante, testes de integraþÒo com requisitos relacionados. AlÚm disso, devem usar a modelaþÒo com Fault Tree Analysis (FTA) para identificar as falhas mais provßveis no sistema e determinar suas possÝveis causas. Os trabalhos devem ser elaborados em formatos nÒo editßveis, como PDF ou imagens, para evitar problemas de formataþÒo. A entrega final deve incluir todas as entregas anteriores, com as devidas alteraþ§es, e respeitar as datas-limite estabelecidas.\r\n\r\nPontos Importantes:\r\n\r\nAnßlise e compreensÒo do caso de estudo fornecido pelo professor.\r\nDesenvolvimento de habilidades em planeamento de projetos, desenho de testes e anßlise de falhas.\r\nIdentificaþÒo de requisitos, atores do sistema e fatores crÝticos de sucesso.\r\nCriaþÒo de testes detalhados, incluindo testes de aceitaþÒo e integraþÒo.\r\nUtilizaþÒo da Fault Tree Analysis (FTA) para identificar falhas e suas causas.", "ranking": 3, "imagem": "projetos/Tabacco_EngRequisitos.jpg"}}, {"model": "portifolio.projeto", "pk": 24, "fields": {"nome": "Apple Price (UiPath - TecWeb)", "dificuldade": "medio", "data_inicio": "2022-04-19", "data_conclusao": "2022-04-24", "descricao": "Project Title: Automation of Price Collection for Apple Devices on Amazon using RPA with UiPath\r\n\r\nProject Description:\r\n\r\nObjective:\r\nThe objective of this project is to automate the collection of prices for Apple devices on Amazon, enabling more effective analysis of price variations over time. To achieve this, we will use the Robotic Process Automation (RPA) software, UiPath.\r\n\r\nRationale:\r\nManually collecting product prices from online stores can be time-consuming and prone to errors. Automating this process using RPA saves time, reduces human errors, and provides accurate and consistent data for market analysis.\r\n\r\nProject Scope:\r\n\r\nSelection of Apple Devices: Define a specific list of Apple devices to be monitored, such as iPhones, iPads, MacBooks, Apple Watches, and so on.\r\n\r\nUiPath Configuration: Set up the automation environment using UiPath, including software installation, configuration, variable definition, and execution options.\r\n\r\nAmazon Navigation: Develop an automation workflow that simulates navigation through relevant categories on the Amazon store, such as \"Electronics\" and \"Computers,\" to find the selected devices.\r\n\r\nData Collection: Develop a workflow that collects information about the devices, including name, price, product rating, availability, and other relevant details.\r\n\r\nData Storage: Store the collected data in a structured format, such as a database or spreadsheet, for subsequent analysis.\r\n\r\nAutomation Scheduling: Configure UiPath to execute the automation at regular intervals to keep price data up to date.\r\n\r\nReports and Analysis: Create reports or charts that display price trends over time and other relevant analyses based on the collected data.", "ranking": 5, "imagem": "projetos/Apple_UiPeth.jpg"}}, {"model": "portifolio.cadeira", "pk": 13, "fields": {"nome": "Web Development", "ano_letivo_frequentado": 2023, "semestre": "4", "creditos_ects": 6, "topicos_abordados": "...", "ranking": 5, "imagem": "cadeiras/car_arduino.png", "nota": 10, "departamento": "DEISI", "carga_horaria": 120, "descricao_cadeira": "....", "professores": [1], "projetos_realizados": [13]}}, {"model": "portifolio.cadeira", "pk": 14, "fields": {"nome": "Data Base", "ano_letivo_frequentado": 2023, "semestre": "4", "creditos_ects": 6, "topicos_abordados": "...", "ranking": 3, "imagem": "cadeiras/ProjBaseDeDados.png", "nota": 14, "departamento": "DEISI", "carga_horaria": 140, "descricao_cadeira": "...", "professores": [1], "projetos_realizados": [17]}}, {"model": "portifolio.cadeira", "pk": 15, "fields": {"nome": "Algorithm and Data Structure", "ano_letivo_frequentado": 2022, "semestre": "3", "creditos_ects": 6, "topicos_abordados": "...", "ranking": 4, "imagem": "cadeiras/DeisiFlix.png", "nota": 15, "departamento": "DEISI", "carga_horaria": 130, "descricao_cadeira": "...", "professores": [1], "projetos_realizados": [14]}}, {"model": "portifolio.cadeira", "pk": 16, "fields": {"nome": "Digital systems", "ano_letivo_frequentado": 2021, "semestre": "2", "creditos_ects": 5, "topicos_abordados": "Boolean Algebra: Study of the principles of Boolean algebra, which is fundamental for digital circuit design.\r\nLogic Gates: Understanding of logic gates (AND, OR, NOT, XOR, etc.) and their application in building digital circuits.\r\nCombinational Circuits: Design and analysis of digital circuits that perform specific functions without memory, such as adders, multiplexers, and decoders.\r\nFlip-Flops and Registers: Study of sequential memory elements, like flip-flops, used to store information in digital systems.\r\nCounters: Design of digital counters that can count, store, and sequence events.\r\nMemories: Introduction to digital memories, such as RAM and ROM, and their organization.\r\nProgrammable Logic Devices (FPGAs): Use of programmable devices to implement custom digital circuits.\r\nNumber Systems and Data Representation: Conversion between different number systems (binary, octal, decimal, hexadecimal) and data representation.\r\nCircuit Minimization: Techniques for simplifying and optimizing digital circuits.\r\nCoding Systems: Study of numeric and character codes, such as BCD, Gray, ASCII, and others.\r\nDigital Circuit Design: Methodologies and tools for designing complex digital circuits.\r\nVHDL and Verilog: Hardware description languages used to design and simulate digital systems.\r\nLogic Synthesis: Use of synthesis tools to translate high-level descriptions into implementable digital circuits.\r\nClocking and Timing Circuits: Synchronization of digital circuits and timing considerations.\r\nState Machines: Design and analysis of sequential systems based on finite state machines.\r\nComputer Architecture: CPU concepts, registers, buses, and memory organization.\r\nMicrocontrollers: Introduction to microcontrollers and embedded system programming.\r\nIntegrated Digital Systems: Design of circuits on silicon chips (ASICs) and VLSI design considerations.\r\nTesting Techniques: Methods for testing the integrity and functionality of digital circuits.\r\nPractical Applications: Examples of digital system applications in electronics, computing, and control engineering.", "ranking": 4, "imagem": "cadeiras/MaquinaLavar.png", "nota": 16, "departamento": "DEISI", "carga_horaria": 130, "descricao_cadeira": "I really enjoyed the Digital Systems course. It was a fascinating journey into the world of digital logic and electronic circuits. This class covered a wide range of topics, from the basics of Boolean algebra to the intricacies of designing complex digital systems.\r\n\r\nLearning about logic gates and how they form the building blocks of digital circuits was particularly exciting. I found it amazing how these gates could be combined to perform a myriad of functions, from simple arithmetic operations to data manipulation.\r\n\r\nThe practical aspects of designing combinational circuits and understanding the operation of flip-flops and registers were both challenging and rewarding. I was able to apply what I learned in class to create functional digital systems, which was incredibly satisfying.\r\n\r\nExploring topics like VHDL and Verilog, as well as logic synthesis, opened my eyes to the world of hardware description and the process of translating high-level designs into tangible digital circuits. I gained a deep appreciation for the intricacies of timing and synchronization in digital systems, and I now have a better understanding of the complexities involved in state machines and computer architecture.\r\n\r\nThe course also provided a valuable introduction to microcontrollers and embedded systems, which I found particularly relevant in today's technology-driven world.\r\n\r\nOverall, I truly enjoyed this Digital Systems course. It not only expanded my knowledge of digital electronics but also gave me the skills and tools to design and analyze digital circuits. This knowledge will undoubtedly be invaluable in my future endeavors in the field of electrical engineering and computer science.", "professores": [1], "projetos_realizados": [15]}}, {"model": "portifolio.cadeira", "pk": 17, "fields": {"nome": "Requirements Engineering and Testing", "ano_letivo_frequentado": 2023, "semestre": "4", "creditos_ects": 5, "topicos_abordados": "Introduction:\r\n\r\nGeneral presentation of the course and its content.\r\nProject Management:\r\n\r\nDefinitions and concepts of project management.\r\nDifferences between projects and operations.\r\nProject governance organization.\r\nRoles in project management.\r\nStakeholders.\r\nConstraints and quality.\r\nStandards for projects.\r\nVariants and derivatives.\r\nSuccess factors.\r\nProjects and organizational structures.\r\nProject management processes.\r\nProcess groups.\r\nKnowledge areas.\r\nRequirements Engineering:\r\n\r\nDefinitions and fundamentals.\r\nRequirements engineering activities.\r\nRequirements matrix.\r\nModels and tools for requirements engineering.\r\nTesting:\r\n\r\nTest design.\r\nFault Tree Analysis (FTA).\r\nExamples of test cases.\r\nAgile: SCRUM:\r\n\r\nPresentation and tutorials on the agile SCRUM methodology.\r\nModels and tools.\r\nExamples of agile project planning and monitoring.\r\nPractical Classes:\r\n\r\nPractical assignments related to the course.\r\nCase studies and exercises.\r\nSubmission of projects and documents related to practical assignments.\r\nSupporting Materials:\r\n\r\nBibliography and supporting documents related to project management, requirements engineering, testing, and agile methodologies.\r\nMoodle Mobile:\r\n\r\nInformation about using the Moodle Mobile app to access course resources.", "ranking": 4, "imagem": "", "nota": 14, "departamento": "DEISI", "carga_horaria": 100, "descricao_cadeira": "This Requirements Engineering and Testing course is incredibly valuable for any Computer Engineering student. It comprehensively covers essential topics, including project management, requirements engineering, and testing. The supporting materials are very helpful, and the practical classes provide a great opportunity to apply the knowledge. I highly recommend this course to anyone looking to deepen their understanding in this field.", "professores": [12], "projetos_realizados": [23]}}, {"model": "portifolio.cadeira", "pk": 18, "fields": {"nome": "Decision Support Systems", "ano_letivo_frequentado": 2023, "semestre": "4", "creditos_ects": 5, "topicos_abordados": "Dimensional Modeling.\r\nETL (Extract, Transform, Load).\r\nReporting.\r\nRelational Modeling.\r\nSQL Language and ETL Concepts.\r\nPentaho Data Integration - ETL.\r\nPower BI.\r\nBusiness Intelligence.\r\nResolution of Power BI Tutorials.", "ranking": 4, "imagem": "", "nota": 14, "departamento": "DEISI", "carga_horaria": 100, "descricao_cadeira": "The Decision Support Systems course is an incredible journey of learning. Throughout the semester, we delve into fundamental concepts, from dimensional modeling and ETL to using Business Intelligence tools like Power BI. The practical assignments challenge us to apply the knowledge we've gained, creating real solutions. The combination of theory and practice makes this course highly valuable, and I look forward to further deepening my understanding in the field of Decision Support Systems.", "professores": [12], "projetos_realizados": [21]}}, {"model": "portifolio.cadeira", "pk": 19, "fields": {"nome": "Computer Graphics", "ano_letivo_frequentado": 2023, "semestre": "4", "creditos_ects": 4, "topicos_abordados": "Introduction to Computer Graphics.\r\nImage Representation.\r\nGeometric Transformations.\r\nLighting and Shading.\r\n3D Modeling.\r\nRasterization Algorithms.\r\nRendering.\r\nAnimation.\r\nComputer Graphics in Real-World Applications.", "ranking": 3, "imagem": "", "nota": 10, "departamento": "DEISI", "carga_horaria": 100, "descricao_cadeira": "The Computer Graphics course is an incredibly creative and technical journey. I've learned to create stunning images and animations, from representing 3D objects to applying lighting and shading to bring my creations to life. It's amazing how we can transform mathematical concepts into impressive visual graphics. This course has inspired me to further explore the world of digital creation, and I believe the knowledge gained here will be invaluable in my academic and professional journey.", "professores": [11], "projetos_realizados": [22]}}, {"model": "portifolio.categoria", "pk": 7, "fields": {"nome": "Technology", "descricao": "This category encompasses news, analyses related to technological advancements, software development, trends, and much more.", "imagem": "categorias/tecnologia.jpg", "data_criacao": "2023-07-07T14:11:23.161Z"}}, {"model": "portifolio.categoria", "pk": 10, "fields": {"nome": "Fashion", "descricao": "This category is dedicated to everything related to fashion, including style tips, fashion trends, and more.", "imagem": "categorias/moda.jpg", "data_criacao": "2023-07-07T20:03:46.088Z"}}, {"model": "portifolio.categoria", "pk": 11, "fields": {"nome": "Travel", "descricao": "In this category, you can explore travel experiences, popular destinations, travel planning tips, and much more.", "imagem": "categorias/viagem.jpg", "data_criacao": "2023-07-07T20:04:57.643Z"}}, {"model": "portifolio.categoria", "pk": 12, "fields": {"nome": "Health", "descricao": "This category is focused on articles about physical and mental health, well-being, exercise, nutrition, and much more.", "imagem": "categorias/saude.jpg", "data_criacao": "2023-07-07T20:05:26.620Z"}}, {"model": "portifolio.categoria", "pk": 13, "fields": {"nome": "Nutrition", "descricao": "Here, you can share recipes, cooking tips, dietary guidance, restaurant recommendations, and much more.", "imagem": "categorias/alimentacao.jpg", "data_criacao": "2023-07-07T20:06:27.662Z"}}, {"model": "portifolio.categoria", "pk": 14, "fields": {"nome": "Culture", "descricao": "In this category, you can explore various cultural topics, such as art, music, cinema, literature, and much more.", "imagem": "categorias/cultura.jpg", "data_criacao": "2023-07-07T20:06:57.419Z"}}, {"model": "portifolio.categoria", "pk": 15, "fields": {"nome": "Finances", "descricao": "Here, you can find tips and advice on personal finances, budgeting, investments, saving money, and much more.", "imagem": "categorias/finacias.jpg", "data_criacao": "2023-07-07T20:07:47.908Z"}}, {"model": "portifolio.categoria", "pk": 16, "fields": {"nome": "Entertainment", "descricao": "In this category, you can find articles related to entertainment, such as movies, TV series, music, celebrities, and much more.", "imagem": "categorias/entretenimento.jpg", "data_criacao": "2023-07-07T20:08:13.450Z"}}, {"model": "portifolio.autor", "pk": 6, "fields": {"nome": "Felipe G. Silva", "biografia": "I'm Felipe GuimarÒes Silva, a technology enthusiast, born in SÒo Paulo. I decided to study Computer Engineering in Portugal to enhance my technical skills and expand my knowledge. Working in multidisciplinary teams has been an enriching experience. I'm excited to explore opportunities that allow me to contribute to innovative solutions and drive technological progress. My journey has been exciting, and I look forward to continuing to grow in this fascinating field.", "foto": "autores/foto-Felipe-Silva.png", "data_nascimento": "2002-04-11", "website": null}}, {"model": "portifolio.artigo", "pk": 14, "fields": {"titulo": "Top 10 Technological Innovate", "autor": 6, "descricao": "Technology is advancing at an unprecedented pace, with innovations that are shaping our future and revolutionizing various industries. In this article, we'll explore the top 10 technological innovations that are making a significant impact on our world.", "data": "2023-07-07T20:26:01.058Z", "destaque": true, "imagem": "artigos/vista-aerea-criativa-da-paisagem-urbana.jpg", "visitas": 4, "conteudo": "Artificial Intelligence (AI):\r\nArtificial Intelligence, or AI, continues to transform industries with its ability to analyze data, make predictions, and automate tasks. Machine learning, a subset of AI, is being used in everything from healthcare to finance.\r\n\r\n5G Technology:\r\nThe rollout of 5G networks is revolutionizing mobile communication. It offers significantly faster internet speeds, lower latency, and the ability to connect more devices simultaneously, paving the way for innovations like the Internet of Things (IoT).\r\n\r\nQuantum Computing:\r\nQuantum computers have the potential to solve complex problems at speeds unimaginable with classical computers. They're expected to have a significant impact on cryptography, drug discovery, and more.\r\n\r\nBiotechnology Advancements:\r\nBiotech innovations, such as CRISPR gene editing, are transforming healthcare, agriculture, and environmental conservation. They hold the promise of treating genetic diseases and developing sustainable solutions.\r\n\r\nRenewable Energy Technologies:\r\nAdvancements in renewable energy technologies, such as solar and wind power, are driving the shift towards clean and sustainable energy sources. These innovations are crucial in combating climate change.\r\n\r\nVirtual Reality (VR) and Augmented Reality (AR):\r\nVR and AR technologies are changing the way we experience digital content and interact with our surroundings. They find applications in gaming, education, training, and more.\r\n\r\nRobotics and Automation:\r\nRobots and automation are becoming increasingly sophisticated, enhancing efficiency in manufacturing, logistics, and healthcare. Robots are now used for everything from surgery to autonomous vehicles.\r\n\r\nInternet of Things (IoT):\r\nThe IoT is connecting everyday devices to the internet, enabling them to collect and share data. It's shaping the way we interact with our homes, cities, and personal devices.\r\n\r\nBlockchain Technology:\r\nBlockchain is transforming industries by providing secure, transparent, and decentralized solutions. It's most well-known for its use in cryptocurrencies like Bitcoin, but it has applications in supply chain management, voting systems, and more.\r\n\r\nSpace Exploration:\r\nInnovations in space technology have been on the rise, with missions to Mars, lunar exploration, and satellite technologies. These advancements have far-reaching implications for Earth and space exploration.", "categoria": [7]}}, {"model": "portifolio.artigo", "pk": 15, "fields": {"titulo": "Online Safety Tips", "autor": 6, "descricao": "Discover effective strategies to protect your online privacy, including the use of strong passwords, VPNs, two-factor authentication, and safe browsing practices.", "data": "2023-07-07T20:30:13.107Z", "destaque": false, "imagem": "artigos/smartphone-gb2c50806f_640.png", "visitas": 1, "conteudo": "With the increase in online activity, it's crucial to take measures to safeguard your privacy and security on the internet. In this article, we'll present effective strategies to ensure your online protection. From using strong passwords to implementing safe browsing practices, these tips will help you keep your personal data safe from cyber threats.\r\n\r\nUse Strong Passwords:\r\nOne of the most basic forms of online protection is using strong passwords. Create unique and complex passwords with a combination of uppercase and lowercase letters, numbers, and special characters. Avoid using obvious personal information and never share your passwords with others. Additionally, consider using a reliable password manager to securely store and generate complex passwords.\r\n\r\nImplement Two-Factor Authentication (2FA):\r\nTwo-factor authentication is an additional layer of security that adds an extra verification step when logging into online accounts. By enabling 2FA, you'll need to provide a second form of authentication, such as a code sent via SMS, an authentication app, or a physical security key. This makes it more challenging for attackers to access your accounts, even if they have your password.\r\n\r\nUse a Virtual Private Network (VPN):\r\nA Virtual Private Network (VPN) creates an encrypted connection between your device and the internet, protecting your data from hackers and interceptions. When using a VPN, you can browse more securely on public Wi-Fi networks, hide your IP address, and keep your online activity private. Be sure to choose a reputable and up-to-date VPN that doesn't log your information.\r\n\r\nKeep Your Devices Updated:\r\nKeeping your devices up to date is essential for online security. This includes updating the operating system, apps, and programs you regularly use. Updates often include security fixes and patches that protect your device from known vulnerabilities. Set your devices to update automatically whenever possible.\r\n\r\nPractice Safe Browsing:\r\nWhen surfing the web, it's important to adopt safe practices. Avoid clicking on suspicious links or emails from unknown senders. Check if the website you're visiting has an SSL certificate (indicated by \"https://\" and a padlock icon). Use trusted browser extensions to block ads, trackers, and malware. Additionally, be cautious about sharing personal information online and avoid disclosing sensitive data on untrustworthy websites.\r\n\r\nBeware of Phishing:\r\nPhishing is a common technique used by hackers to obtain confidential information, such as passwords and credit card numbers, through fake emails or fraudulent web pages. Be vigilant about suspicious emails or messages that request personal or financial information. Never click on suspicious links or provide confidential information without verifying the authenticity of the request.\r\n\r\nConclusion:\r\nProtecting your online privacy is a top priority in today's digital world. By implementing these tips, such as using strong passwords, two-factor authentication, VPNs, and safe browsing practices, you'll strengthen your online security and reduce the risks of falling victim to cyber threats. Remember that awareness and preventive measures are crucial to ensuring a safe and secure online experience.", "categoria": [7]}}, {"model": "portifolio.artigo", "pk": 16, "fields": {"titulo": "Summer Fashion Trends", "autor": 6, "descricao": "Discover the latest summer fashion trends for the season, including prints, colors, clothing cuts, and accessories that are in vogue this year.", "data": "2023-07-07T20:31:55.441Z", "destaque": true, "imagem": "artigos/bela-foto-de-klein-venedig-bamberg-alemanha-do-outro-lado-de-um-rio-com-barcos-e_7m1jvfU.jpg", "visitas": 0, "conteudo": "With the arrival of summer, it's time to update your wardrobe and stay up-to-date with the latest fashion trends. In this article, we will present the main fashion trends for the summer season. From vibrant prints to refreshing colors and elegant clothing cuts, discover the trends that will ensure style and freshness on hot summer days.\r\n\r\nFloral Prints:\r\nFloral prints are a summer classic and they are back in full force this season. Large and colorful flowers on dresses, blouses, and skirts bring a romantic and feminine touch to your look. Pair them with neutral accessories for a balanced appearance.\r\n\r\nStripes:\r\nStripes are still on-trend this summer. They can be vertical, horizontal, wide, or narrow, bringing a modern and elegant flair to any clothing piece. Try pairing a striped top with a solid-colored skirt or pants for an interesting contrast.\r\n\r\nVibrant Colors:\r\nThis summer, vibrant colors are dominating the runways and the streets. Shades like orange, pink, yellow, and lime green bring energy and joy to summer outfits. Opt for key pieces in these colors to add a bold touch to your look.\r\n\r\nOff-the-Shoulder Cuts:\r\nOff-the-shoulder cuts are perfect for summer, as they provide a touch of sensuality without sacrificing comfort. Dresses, tops, and jumpsuits with bare shoulders are in demand, allowing you to enjoy the sun and the cool breeze.\r\n\r\nLight and Flowy Pieces:\r\nIn the summer heat, it's essential to choose light and flowy clothing. Long dresses and skirts made from fabrics like cotton, linen, and silk are great options to stay cool and comfortable. Loose jumpsuits and wide-leg pants are also trendy choices that combine style and comfort.\r\n\r\nStraw Accessories:\r\nStraw accessories are in trend this season. Bags, hats, and sandals made from this material add a natural and relaxed touch to summer outfits. Moreover, they are versatile and can be paired with a variety of looks, from casual to sophisticated.\r\n\r\nCat-Eye Sunglasses:\r\nCat-eye sunglasses remain an essential item to give your summer look a vintage and elegant touch. Choose a pair with frames in vibrant colors or fun prints to add personality to your style.\r\n\r\nConclusion:\r\nSummer fashion trends offer a variety of styles for you to stand out with elegance and freshness this season. From floral prints and stripes to vibrant colors and off-the-shoulder cuts, there are options for every taste and style. Remember to choose lightweight and comfortable pieces and add accessories like straw bags and cat-eye sunglasses to complete your look. Now you're ready to rock the most stylish summer outfits!", "categoria": [10]}}, {"model": "portifolio.artigo", "pk": 18, "fields": {"titulo": "10 Exotic Travel Destinations", "autor": 6, "descricao": "Presenting 10 exotic destinations around the world that offer breathtaking landscapes, unique cultures, and unforgettable travel experiences.", "data": "2023-07-07T20:37:53.924Z", "destaque": true, "imagem": "artigos/palacio-da-comunicacao-no-crepusculo-do-verao-madrid.jpg", "visitas": 0, "conteudo": "If you're looking for unique adventures and breathtaking landscapes, exotic destinations around the world offer a variety of experiences beyond the ordinary. In this article, we'll introduce 10 destinations that enchant travelers with their unique cultures, stunning landscapes, and opportunities to explore truly extraordinary places. Get ready to be amazed by these exotic destinations and embark on an unforgettable journey.\r\n\r\nMaldives:\r\nThe Maldives is famous for its crystal-clear waters, white sandy beaches, and coral reefs. Explore luxury resorts and enjoy activities such as diving, snorkeling, and sunset boat rides.\r\n\r\nBora Bora, French Polynesia:\r\nBora Bora is a tropical paradise known for its turquoise waters and overwater bungalows. Enjoy incredible dives, go on a jet ski ride, or simply relax on paradise beaches.\r\n\r\nSantorini, Greece:\r\nWith its whitewashed architecture contrasting with the intense blue sea, Santorini is a stunning island in the Aegean Sea. Explore charming villages, visit local wineries, and enjoy spectacular sunset views.\r\n\r\nMachu Picchu, Peru:\r\nMachu Picchu is an ancient Inca city nestled in the Andes mountains. Discover the mysterious ruins, hike the Inca Trail, and marvel at the mountainous landscape surrounding this historic site.\r\n\r\nPetra, Jordan:\r\nKnown as the \"Rose City,\" Petra is an ancient treasure carved into rocks. Explore the impressive facades and tombs carved into the rocks, like the iconic Treasury, and walk through the narrow gorge known as the Siq.\r\n\r\nFiji Islands:\r\nThe Fiji Islands are a tropical paradise in the South Pacific. Enjoy white sandy beaches, crystal-clear waters, snorkeling in colorful coral reefs, and spectacular dives.\r\n\r\nThailand:\r\nThailand combines lush landscapes, sacred temples, and a rich culture. Explore the stunning beaches of Phuket, visit the temples of Bangkok, take a boat trip to the Phi Phi Islands, and savor delicious Thai cuisine.\r\n\r\nDubai, United Arab Emirates:\r\nDubai is known for its modern and extravagant architecture. Explore impressive skyscrapers, shop at luxurious malls, visit the Burj Khalifa, the world's tallest building, and relax on breathtaking beaches.\r\n\r\nGalßpagos Islands, Ecuador:\r\nThe Galßpagos Islands are a unique archipelago known for its diverse and untouched wildlife. Take a cruise through the islands, observe giant tortoises, sea lions, marine iguanas, and a variety of exotic birds.\r\n\r\nKyoto, Japan:\r\nKyoto is a Japanese city with a charming atmosphere and a rich cultural heritage. Visit historic temples like the Kinkaku-ji (Golden Pavilion) and the Fushimi Inari Shrine, enjoy the beautiful landscapes of the Arashiyama Bamboo Grove, and experience the tea ceremony.\r\n\r\nConclusion:\r\nExotic destinations around the world offer a unique opportunity to explore stunning landscapes and immerse yourself in fascinating cultures. From paradise islands to impressive historic sites, each destination offers unforgettable travel experiences. Get ready to embark on an adventure and create lasting memories as you explore these exotic and inspiring places.", "categoria": [11]}}, {"model": "portifolio.artigo", "pk": 19, "fields": {"titulo": "Traveling on a Limited Budget", "autor": 6, "descricao": "Discover smart strategies and practical tips for traveling on a limited budget, including budget-friendly accommodations, affordable dining options, and free or low-cost activities.", "data": "2023-07-07T20:38:56.709Z", "destaque": true, "imagem": "artigos/monumento-victor-emmanuel-ii-em-roma-ao-por-do-sol-italia.jpg", "visitas": 0, "conteudo": "Traveling is one of the best experiences we can have, but often we think that a large budget is necessary to do so. However, with some smart strategies and practical tips, it's possible to explore the world even on a limited budget. In this article, we will share some ideas to help you travel economically, from finding affordable accommodations to enjoying tasty meals without breaking the bank, and discovering free or low-cost activities at your destinations.\r\n\r\nPlan in Advance:\r\nOne of the keys to traveling on a limited budget is proper planning. Research and compare prices for flights, accommodations, and tour packages in advance. Flexibility in travel dates can allow you to find cheaper fares. Also, consider traveling in the off-peak season when prices are often more affordable.\r\n\r\nSave on Accommodation:\r\nThere are various options for affordable accommodation that can help you save money. Consider staying in hostels, guesthouses, or even shared rooms through online accommodation services. Another option is couchsurfing, where you can stay in locals' homes for free. Additionally, search for deals and discount coupons on booking websites.\r\n\r\nAffordable Dining:\r\nEating out can consume a significant portion of your travel budget, but there are ways to save in this area. Try local cuisine at simpler, family-run restaurants where prices are often lower compared to tourist establishments. You can also opt to buy food at local markets and prepare your own meals in accommodations with shared kitchens.\r\n\r\nSmart Transportation:\r\nWhen getting around during your trip, research public transportation options like buses and subways, which are generally more economical than taxis or private transportation services. Walking or renting bicycles are also great options for exploring a city economically, as well as providing a more immersive experience.\r\n\r\nFree or Low-Cost Activities:\r\nTake advantage of free or low-cost activities available at your destination. Visit parks, squares, free museums, or those with free entry days, participate in local cultural events, and explore the natural beauty of the area. Research in advance which attractions offer discounts or special promotions.\r\n\r\nInteraction with Locals:\r\nOne of the best ways to immerse yourself in the local culture is by interacting with the residents. Besides being an enriching experience, it can lead to discoveries of lesser-known places and valuable tips for saving money in the region. Talk to the locals, participate in community activities, and be open to meeting new people.\r\n\r\nConclusion:\r\nTraveling on a limited budget doesn't mean giving up an incredible experience. With planning, research, and a bit of creativity, it's possible to explore the world economically and make the most of every destination. Remember that the best memories of a trip are often related to the experiences lived and the connections made with local people. So, get ready to embark on this adventure and make the most of every moment, regardless of the size of your budget", "categoria": [11]}}, {"model": "portifolio.contato", "pk": 1, "fields": {"nome": "felipe", "email": "felipeguimaraes9787@gmail.com", "telefone": "939470799", "assunto": "duvida", "mensagem": "sdgsdgs"}}, {"model": "portifolio.contato", "pk": 2, "fields": {"nome": "Felipe", "email": "felipeguimaraes9787@gmail.com", "telefone": "234532532", "assunto": "duvida", "mensagem": "safasf"}}, {"model": "portifolio.contato", "pk": 3, "fields": {"nome": "feljkasd", "email": "felipe@gmail.com", "telefone": "123214", "assunto": "sugestao", "mensagem": "325ewgsdg"}}, {"model": "portifolio.contato", "pk": 4, "fields": {"nome": "feljkasd", "email": "felipe@gmail.com", "telefone": "123214", "assunto": "sugestao", "mensagem": "325ewgsdg"}}, {"model": "portifolio.contato", "pk": 5, "fields": {"nome": "fas", "email": "feoi@gmail.com", "telefone": "124124", "assunto": "sugestao", "mensagem": "ewr"}}, {"model": "portifolio.contato", "pk": 6, "fields": {"nome": "felipe", "email": "felipe@gmail.com", "telefone": "2342424324", "assunto": "sugestao", "mensagem": "ewfrewf"}}, {"model": "portifolio.contato", "pk": 7, "fields": {"nome": "jpsofwe", "email": "fekuoerw@gmail.com", "telefone": "324566544", "assunto": "sugestao", "mensagem": "fdgsgdf"}}, {"model": "portifolio.contato", "pk": 8, "fields": {"nome": "jpsofwe", "email": "fekuoerw@gmail.com", "telefone": "324566544", "assunto": "sugestao", "mensagem": "fdgsgdf"}}, {"model": "portifolio.contato", "pk": 9, "fields": {"nome": "damkþs", "email": "felipe@gmail.com", "telefone": "939470799", "assunto": "sugestao", "mensagem": "effad"}}, {"model": "portifolio.contato", "pk": 10, "fields": {"nome": "damkþs", "email": "felipe@gmail.com", "telefone": "939470799", "assunto": "sugestao", "mensagem": "effad"}}, {"model": "portifolio.contato", "pk": 11, "fields": {"nome": "sfan alsdnj", "email": "felipe@gmail.com", "telefone": "293898237", "assunto": "duvida", "mensagem": "ewrh"}}, {"model": "portifolio.contato", "pk": 12, "fields": {"nome": "sfan alsdnj", "email": "felipe@gmail.com", "telefone": "293898237", "assunto": "duvida", "mensagem": "ewrh"}}, {"model": "portifolio.contato", "pk": 13, "fields": {"nome": "sefkjbebf", "email": "wejb@gmail.comn", "telefone": "12312413", "assunto": "outro", "mensagem": "asfa"}}, {"model": "portifolio.contato", "pk": 14, "fields": {"nome": "def", "email": "felipe@gmail.com", "telefone": "2309439823", "assunto": "sugestao", "mensagem": "asndaf"}}, {"model": "portifolio.contato", "pk": 15, "fields": {"nome": "feli", "email": "felipe@gmail.com", "telefone": "2345345666", "assunto": "reclamacao", "mensagem": "jlasfnjslfn"}}, {"model": "portifolio.contato", "pk": 16, "fields": {"nome": "feko", "email": "felipe@gmail.com", "telefone": "2342343243", "assunto": "duvida", "mensagem": "sf"}}, {"model": "portifolio.regiao", "pk": 1, "fields": {"nome": "Lisboa"}}, {"model": "portifolio.regiao", "pk": 2, "fields": {"nome": "Porto"}}, {"model": "portifolio.praia", "pk": 1, "fields": {"nome": "Praia Sul", "regiao": 1}}, {"model": "portifolio.praia", "pk": 2, "fields": {"nome": "Praia Norte", "regiao": 1}}, {"model": "portifolio.praia", "pk": 3, "fields": {"nome": "Praia Este", "regiao": 2}}, {"model": "portifolio.praia", "pk": 4, "fields": {"nome": "Praia Norte", "regiao": 1}}]
